In [3]:
people = {
    "first": ["Shankar", "Niru", "Akshara"],
    "last": ["R", "S", "S"],
    "email": ["shan@email.com", "niru@email.com", "aksh@email.com"]
}

In [4]:
people["email"]

['shan@email.com', 'niru@email.com', 'aksh@email.com']

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [7]:
df

     first last           email
0  Shankar    R  shan@email.com
1     Niru    S  niru@email.com
2  Akshara    S  aksh@email.com

In [8]:
df["email"]

0    shan@email.com
1    niru@email.com
2    aksh@email.com
Name: email, dtype: object

In [9]:
type(df["email"])

pandas.core.series.Series

In [10]:
df.email

0    shan@email.com
1    niru@email.com
2    aksh@email.com
Name: email, dtype: object

In [11]:
df[["last", "email"]]

  last           email
0    R  shan@email.com
1    S  niru@email.com
2    S  aksh@email.com

In [12]:
type(df[["last", "email"]])

pandas.core.frame.DataFrame

In [19]:
df.columns

Index(['first', 'last', 'age'], dtype='object')

In [22]:
df.iloc[0]

first    Shankar
last           R
age           41
Name: 0, dtype: object

In [23]:
df.iloc[[0,1]]

     first last  age
0  Shankar    R   41
1     Niru    S   40

In [24]:
df.iloc[[0,1], 2]

0    41
1    40
Name: age, dtype: int64

In [26]:
df

     first last  age
0  Shankar    R   41
1     Niru    S   40
2  Akshara    S    5

In [30]:
df.loc[[0, 1]]

     first last  age
0  Shankar    R   41
1     Niru    S   40

In [13]:
df.loc[[0,1], "email"]

0    shan@email.com
1    niru@email.com
Name: email, dtype: object

In [14]:
# adding/removing columns
df["first"] + " " + df["last"]

0    Shankar R
1       Niru S
2    Akshara S
dtype: object

In [15]:
df["full_name"] = df["first"] + " " + df["last"]

In [16]:
df

     first last           email  full_name
0  Shankar    R  shan@email.com  Shankar R
1     Niru    S  niru@email.com     Niru S
2  Akshara    S  aksh@email.com  Akshara S

In [19]:
df.drop(columns=["first", "last"], inplace=True)

In [20]:
df

            email  full_name
0  shan@email.com  Shankar R
1  niru@email.com     Niru S
2  aksh@email.com  Akshara S

In [22]:
# df["full_name"].str.split(" ")
df["full_name"].str.split(" ", expand=True)

         0  1
0  Shankar  R
1     Niru  S
2  Akshara  S

In [23]:
df[["first", "last"]] = df["full_name"].str.split(" ", expand=True)

In [24]:
df

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S

In [28]:
# adding/removing rows
# df.append({"first": "Saba"}) # TypeError: Can only append a dict if ignore_index=True
df.append({"first": "Saba"}, ignore_index=True)

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S
3             NaN        NaN     Saba  NaN

In [29]:
people = {
    "first": ["Saba", "Kimi"],
    "last": ["G", "R"],
    "email": ["saba@email.com", "kimi@email.com"]
}

df2 = pd.DataFrame(people)

In [30]:
df2

  first last           email
0  Saba    G  saba@email.com
1  Kimi    R  kimi@email.com

In [31]:
df.append(df2, ignore_index=True) # no inplace possible here

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S
3  saba@email.com        NaN     Saba    G
4  kimi@email.com        NaN     Kimi    R

In [33]:
df = df.append(df2, ignore_index=True)

In [34]:
df

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S
3  saba@email.com        NaN     Saba    G
4  kimi@email.com        NaN     Kimi    R

In [35]:
df.drop(index=4)

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S
3  saba@email.com        NaN     Saba    G

In [37]:
df.drop(index=4, inplace=True)

In [38]:
df

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S
3  saba@email.com        NaN     Saba    G

In [39]:
df.drop(index=df[df["last"] == "G"].index)

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S

In [41]:
filt = df["last"] == "G"
df.drop(index=df[filt].index)

            email  full_name    first last
0  shan@email.com  Shankar R  Shankar    R
1  niru@email.com     Niru S     Niru    S
2  aksh@email.com  Akshara S  Akshara    S